{
	"invoiceData": {
		"idinvoices": [
			59
		],
		"invoice_title": [
			"Second Draw Invoice"
		],
		"invoice_date": [
			"2022-07-12 00:00:00"
		],
		"invoice_notes": [
			"Second Draw Invoice: \n\nCompletion of demolition, foundation, temp power service, framing, and roofing, \nStart of plumbing, and electrical work. "
		],
		"projects_idprojects": [
			24
		],
		"invoice_sent": [
			1
		],
		"invoice_total_amount": [
			77420.7117
		],
		"client_name": [
			"Dylan + Kat Hostetter"
		],
		"client_email": [
			null
		],
		"client_address": [
			null
		],
		"project_name": [
			"Dylan & Kat Addition"
		]
	},
	"expenses": {
		"idinvoice_expense": [
			418,
			419,
			420,
			421,
			422,
			423,
			424,
			425,
			426,
			427,
			428,
			429,
			430,
			431,
			432,
			433,
			434,
			435,
			436,
			437,
			438,
			439,
			440,
			441,
			442,
			443,
			444,
			445,
			446,
			447,
			448,
			449,
			450,
			451,
			452,
			453,
			454,
			455,
			456,
			457,
			458,
			459,
			460
		],
		"invoices_idinvoices": [
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59
		],
		"expenses_idexpenses": [
			564,
			599,
			617,
			492,
			485,
			486,
			487,
			550,
			527,
			540,
			609,
			606,
			538,
			510,
			524,
			532,
			585,
			621,
			619,
			575,
			572,
			495,
			614,
			500,
			508,
			605,
			496,
			536,
			577,
			579,
			562,
			563,
			608,
			620,
			483,
			616,
			578,
			571,
			615,
			573,
			574,
			565,
			570
		],
		"invoice_expense_description": [
			"Task: Demolition  Description: Demolition safety PPE",
			"Task: Demolition  Description: demolition supplies misc ",
			"Task: Demolition  Description: dumpsters for demolition and misc",
			"Task: Set Form and Finish Concrete Flatwork  Description: Sill seal",
			"Task: Footing Dig and Fill Labor  Description: Steel posts for guardrail ",
			"Task: Footing Dig and Fill Labor  Description: Wood for guardrail ",
			"Task: Footing Dig and Fill Labor  Description: Wood for guardrail ",
			"Task: Kerdi Shower Pan with Liner Drain  Description: shower pan",
			"Task: Kitchen Cabinets  Description: Deposit for kitchen cabinets",
			"Task: Siding  Description: siding, trim, and soffit order ",
			"Task: Siding  Description: soffit material from reese wholesale ",
			"Task: Siding Labor  Description: siding start check",
			"Task: Exterior Trim Smart Soffit  Description: ACTUAL RECEIPT $730.10  boards, upstairs bathroom framing changes",
			"Task: Roofing Material  Description: Roofing material",
			"Task: Roofing Material  Description: Underlayment",
			"Task: Roofing Material  Description: Most roofing materials",
			"Task: Roofing Material  Description: roof items return",
			"Task: Roofing Labor  Description: 26 sq installed. 3 sq front, 11 sq main pitch, 12 sq back pitch. 14x110  + 12x55",
			"Task: 20 Yard Dumpster  Description: GREENES ROLL OFF SERVICE",
			"Task: Materials - Contingency  Description: framing materials roof and misc ",
			"Task: Materials - Roof Framing  Description: roof framing package",
			"Task: Materials - MISC Framing Materials  Description: Password gas",
			"Task: Materials - MISC Framing Materials  Description: ProBuild purchase of long 2x4s and 2x6s ",
			"Task: Framing Labor  Description: Moving and lifting framing lumber for framers ",
			"Task: Framing Labor  Description: Second payment framing ",
			"Task: Framing Labor  Description: framing final ",
			"Task: Remodel Framing Materials  Description: I joist for second floor",
			"Task: Remodel Framing Materials  Description: STORE CREDIT: Framing materials returned. Partial of this receipt pictured. Combined return. ",
			"Task: Remodel Framing Materials  Description: framing materials from menards",
			"Task: Remodel Framing Materials  Description: misc remodel framing lumber and parts",
			"Task: Rough Plumbing Labor  Description: Rough plumbing ",
			"Task: Rough Plumbing Labor  Description: Pipe for rough plumbing ",
			"Task: Rough Plumbing Labor  Description: rough plumbing start",
			"Task: Rough Plumbing Labor  Description: rough plumbing",
			"Task: Rough Electrical Material   Description: Temp power pole concrete",
			"Task: Rough Electrical Material   Description: rough electrical down payment ",
			"Task: Concrete Blocks  Description: block return ",
			"Task: Materials Second Floor  Description: Framing lumber package",
			"Task: Materials Second Floor  Description: ceiling framing ",
			"Task: Port-a-pottie  Description: SERVICE SANITATION",
			"Task: Port-a-pottie  Description: SERVICE SANITATION",
			"Task: Guard Rail Materials  Description: Menards",
			"Task: Guard Rail Materials  Description: Return guard rail materials. "
		],
		"invoice_expense_adjustment": [
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1
		],
		"invoice_expense_price": [
			57.3381,
			41.0466,
			2577.133,
			14.7203,
			643.9096,
			399.7415,
			591.4104,
			1367.5242,
			8330,
			6303.2753,
			511.5453,
			5950,
			640.0653,
			705.0155,
			358.9516,
			3688.286,
			-67.7229,
			2618,
			1071,
			2564.4262,
			5970.3014,
			148.75,
			549.5539,
			327.25,
			4165,
			1785,
			224.2317,
			-1515.2984,
			791.4333,
			583.3023,
			1190,
			2183.4596,
			1785,
			372.946,
			12.8401,
			4760,
			-133.8869,
			6086.7905,
			2441.4278,
			211.7724,
			152.0463,
			135.1364,
			-188.3413
		]
	},
	"time": {
		"idinvoice_time": [
			520,
			521,
			522,
			523,
			524,
			525,
			526,
			527,
			528,
			529,
			530,
			531,
			532,
			533,
			534,
			535,
			536,
			537,
			538,
			539,
			540,
			541,
			542,
			543,
			544,
			545,
			546
		],
		"invoice_idinvoice": [
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59,
			59
		],
		"punchclock_idpunchclock": [
			878,
			886,
			887,
			891,
			894,
			897,
			905,
			880,
			881,
			888,
			889,
			892,
			899,
			970,
			992,
			642,
			806,
			835,
			1015,
			877,
			879,
			883,
			890,
			893,
			900,
			991,
			994
		],
		"invoice_time_description": [
			"Worker Oliver McGraw Task: 572 Description: Interior framing. Demo windows and doors for reframing. Temp walls. ",
			"Worker Oliver McGraw Task: 572 Description: install kitchen header. demo stairs and basement mechanicals and misc for framing repairs ",
			"Worker Oliver McGraw Task: 572 Description: rebuild kitchen walls and floor. frame door opening to addition. misc framing and clean up. ",
			"Worker Oliver McGraw Task: 572 Description: Interior framing. Misc meetings and pick up and delivery of additional lumber packages. No charge for truck and trailer. ",
			"Worker Oliver McGraw Task: 572 Description: Upstairs remodel framing ",
			"Worker Oliver McGraw Task: 572 Description: Basement framing repairs ",
			"Worker Oliver McGraw Task: 572 Description: Moving lumber for Oscar ",
			"Worker Tommy Coonan Task: 572 Description: Framed center wall. Tore out stairs. Supported floor. Removed temporary walls. Removed garbage from basement",
			"Worker Tommy Coonan Task: 572 Description: Framed side double doors, side window. Built temporary walls. ",
			"Worker Tommy Coonan Task: 572 Description: Demolished kitchen wall. Rebuilt kitchen wall. Rebuilt kitchen floor. Removed framing for second floor. Decked kitchen floor. Hung OSB to protect appliances",
			"Worker Tommy Coonan Task: 572 Description: Framing",
			"Worker Tommy Coonan Task: 572 Description: Demo doorways upstairs built wall",
			"Worker Tommy Coonan Task: 572 Description: Frames doorway in basement framed roof patch deep clean entire house",
			"Worker Tommy Coonan Task: 345 Description: Delivered lumber tidied lot",
			"Worker Tommy Coonan Task: 712 Description: Installed bathroom subfloor",
			"Worker Brandon Jackson Task: 402 Description: Went to ace to have keys made. Grabbed gas one plugs for Thomas. Went to two different napas for oil change stuff",
			"Worker Brandon Jackson Task: 590 Description: Went to Allied eclectic for temp power pole. Installed temp power pole. ",
			"Worker Brandon Jackson Task: 405 Description: Installed gaurd rail. Went to Menards for tools to Install gaurd rail.",
			"Worker Brandon Jackson Task: 712 Description: Picked up clawfoot bathtub from Tim and Eric's awesome show great job store. Installed clawfoot bathtub into second story window.",
			"Worker James Kronick Task: 572 Description: Took sidding off and framed",
			"Worker James Kronick Task: 572 Description: Framing labor",
			"Worker James Kronick Task: 572 Description: Framing labor",
			"Worker James Kronick Task: 572 Description: Framing and siding labor",
			"Worker James Kronick Task: 572 Description: Framing labor",
			"Worker James Kronick Task: 572 Description: Finished attic and general cleaning",
			"Worker James Kronick Task: 341 Description: Menards returns and purchases",
			"Worker James Kronick Task: 712 Description: Bathroom floor"
		],
		"invoice_time_adjustment": [
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1,
			1
		],
		"invoice_unit_price": [
			56.049,
			56.049,
			56.049,
			56.049,
			56.049,
			56.049,
			56.049,
			35.4977,
			35.4977,
			35.4977,
			35.4977,
			35.4977,
			35.4977,
			35.4977,
			35.4977,
			41.1026,
			26.18,
			41.1026,
			41.1026,
			28.9586,
			28.9586,
			28.9586,
			28.9586,
			28.9586,
			28.9586,
			19.065,
			28.9586
		],
		"invoice_quantity": [
			7,
			8,
			8,
			9.49,
			7.5,
			4.25,
			0.75,
			8.5,
			8,
			9,
			5.99,
			8.07,
			8.08,
			1,
			8.06,
			9.1,
			2.23,
			8.5,
			3,
			7.64,
			8.39,
			8.77,
			8.84,
			8.08,
			8,
			5.7,
			0.98
		]
	},
	"contractor": {
		"address": "448 W 31st St, Indianapolis, IN 46208",
		"email": "oliver@mcgrawdesignbuild.com",
		"name": "McGraw Design & Build",
		"phone": "(317) 782-5271",
		"website": "https://www.mcgrawdesignbuild.com"
	}
}